# pandas

In [1]:
import pandas as pd
import numpy as np

dict = {
    'country':['Brazil','Russia','India','China','South Africa'],
    'capital':['Brasilia','Moscow','New Delhi','Beijing','Pretoria'],
    'area': [8.516,17.10,3.286,9.455,1.22],
    'population': [200.4,152.3,1233,23.34,233]
}
brics =pd.DataFrame(dict, index = ['Br','Ru','In','Ch','Sa'])
#brics.index = ['Br','Ru', 'In','Ch','Sa']
print(brics)

         country    capital    area  population
Br        Brazil   Brasilia   8.516      200.40
Ru        Russia     Moscow  17.100      152.30
In         India  New Delhi   3.286     1233.00
Ch         China    Beijing   9.455       23.34
Sa  South Africa   Pretoria   1.220      233.00

## Series

In [2]:
labels = ['a','b','c']
my_data =[10,0,30]
arr = np.array(my_data)
d = {'a':10,'b':0,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1     0
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels)

a    10
b     0
c    30
dtype: int64

In [5]:
pd.Series(my_data,labels)

a    10
b     0
c    30
dtype: int64

In [6]:
pd.Series(d)

a    10
b     0
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1     0
2    30
dtype: int64

In [8]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [9]:
ser1 = pd.Series([1,2,3,4],['USA','USSR','JPN','GER'])

In [10]:
ser2 = pd.Series([1,2,5,4],['USA','Germany', 'Italy','Japan'])

In [11]:
ser2['USA']

1

In [12]:
ser3 = pd.Series(data=labels)

In [13]:
ser1 + ser2

GER        NaN
Germany    NaN
Italy      NaN
JPN        NaN
Japan      NaN
USA        2.0
USSR       NaN
dtype: float64

## dataframes part 1

In [14]:
from numpy.random import randn
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [17]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.334983
Name: A, dtype: float64

In [19]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [20]:
df.iloc[0]

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.334983
Name: A, dtype: float64

In [21]:
df.loc['A','X']

0.6281327087844596

In [22]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# datafram part 2

In [23]:
booldf = df > 0
booldf

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [24]:
df[booldf]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118       NaN       NaN  0.605965  0.331800
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [25]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [26]:
df[df['W']>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [27]:
resultdf =df[df['W']>0]

In [28]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [29]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [30]:
boolser= df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [31]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [32]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [33]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.334983
1     B  0.651118 -0.319318 -0.848077  0.605965  0.331800
2     C -2.018168  0.740122  0.528813 -0.589001 -1.278046
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
4     E  0.190794  1.978757  2.605967  0.683509  2.169552

In [34]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [35]:
df.reset_index(inplace=True)

In [36]:
df

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.334983
1     B  0.651118 -0.319318 -0.848077  0.605965  0.331800
2     C -2.018168  0.740122  0.528813 -0.589001 -1.278046
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
4     E  0.190794  1.978757  2.605967  0.683509  2.169552

In [37]:
df['states']=['wa','ca','ny','or','co']

In [38]:
df.set_index('states')

       index         W         X         Y         Z       new
states
wa         A  2.706850  0.628133  0.907969  0.503826  3.334983
ca         B  0.651118 -0.319318 -0.848077  0.605965  0.331800
ny         C -2.018168  0.740122  0.528813 -0.589001 -1.278046
or         D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
co         E  0.190794  1.978757  2.605967  0.683509  2.169552

# dataframe 3

In [41]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index= pd.MultiIndex.from_tuples(hier_index)

In [56]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [57]:
df

             A         B
G1 1  0.041460 -0.411055
   2 -0.771329  0.110477
   3 -0.804652  0.253548
G2 1  0.649148  0.358941
   2 -1.080471  0.902398
   3  0.161781  0.833029

In [59]:
df.loc['G1'].loc[1]

A    0.041460
B   -0.411055
Name: 1, dtype: float64

In [63]:
df.index.names= ['Groups','num']

In [61]:
df

                   A         B
Groups num
G1     1    0.041460 -0.411055
       2   -0.771329  0.110477
       3   -0.804652  0.253548
G2     1    0.649148  0.358941
       2   -1.080471  0.902398
       3    0.161781  0.833029

In [64]:
df.loc['G2'].loc[2]

A   -1.080471
B    0.902398
Name: 2, dtype: float64

In [65]:
df.xs('G1')

            A         B
num
1    0.041460 -0.411055
2   -0.771329  0.110477
3   -0.804652  0.253548

In [66]:
df.xs(1,level='num')

               A         B
Groups
G1      0.041460 -0.411055
G2      0.649148  0.358941

# Missing data

In [67]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [68]:
df = pd.DataFrame(d)

In [69]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [77]:
df.fillna(value='fill')

      A     B  C
0   1.0   5.0  1
1   2.0  fill  2
2  fill  fill  3

In [78]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [79]:
data = {'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'person':['Sam','Charlie','Amy','Vanessa', 'Carl','Sarah'],
       'sales':[200,120,340,124,243,350]}

In [80]:
df =pd.DataFrame(data)

In [81]:
df

  company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [83]:
df.groupby('company').mean()

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [84]:
df.groupby('company').std()

              sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [86]:
df.groupby('company').min()

          person  sales
company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [85]:
df.groupby('company').std().loc['FB']

sales    75.660426
Name: FB, dtype: float64